{
  "html": [
    {
      "page": "html",
      "title": "HTML 4 X HTML 5",
      "img": "https://cdn.discordapp.com/attachments/878488898974658602/912341275636817940/Art_1_Html5-vs-Html4.jpg",
      "subtitle": "Diferenças entre as  versões 4 e 5 do HTML",
      "article": " <p>O HTML4 ocupou lugar de destaque no mundo web por muitos anos. Ainda teremos um bom tempo de espera até que o HTML5 se torne de fato um padrão na web e que todos os browsers e tecnologias afins o assumam como centro de implementação. Como programador web, é muito interessante que saiba quais as principais diferenças entre ambas as versões, justamente para que possa poupar tempo e aumentar a produtividade em situações como essa.</p>\n    <br>\n    <p>Uma das características mais marcantes dessa nova versão da linguagem é o fato de que ela não é uma versão final – isto é: seguirá mudando ao longo do tempo. Isso inclui dizer que os desenvolvedores da linguagem estarão sempre adicionando e removendo atributos, tags e o que considerarem interessantes a ela. Ao mesmo tempo, constitui um risco se você estiver usando HTML 5 como algo definitivo no seu projeto. Isso significa que se optar pela linguagem mais recente terá de seguir suas atualizações e estar constantemente evoluindo seu código.</p>\n<br>\n    <p>O HTML5 foi feito para ser simples, o que implica em uma sintaxe extremamente mais simples e limpa. A simples declaração do doctype foi mais uma das facilidades incluídas na nova versão. Agora, você precisa inserir apenas um <!doctype html> no início do seu documento e tudo estará pronto. Além disso, a sintaxe do HTML5 é compatível também com o HTML4 e o XHTML1.</p>\n<br>\n    <p>A linguagem apresenta um elemento novo, o &lt;canvas&gt, responsável por substituir muitas das implementações antes feitas em Flash. Muitos desenvolvedores o veem como obsoleto e futuramente morto.</p>\n    <p>A extensão de tags a um tool de novos e interessantes recursos fez uma grande diferença na linguagem. Tags como &lt;header&gt e &lt;footer&gt (que estendem a funcionalidade de tabelas para a página como um todo), &lt;section&gt e &lt;article&gt (que permitem marcar áreas específicas dos layouts), &lt;video&gt e &lt;audio&gt(para uma inclusão melhorada de conteúdos multimídia nas páginas) e &lt;menu&gt e &lt;figure&gt(para bem arranjar textos, imagens e menus) trazem todo um conjunto de implementações e funcionalidades bastante pertinentes para a web de hoje.</p>\n   <br>\n\n    <p>A remoção de alguns recursos como as <em>tags\n    </em>&lt;center&gt;, &lt;big&gt;, &lt;font&gt;, etc fazem com que a responsabilidade do CSS aliado à nova linguagem só aumente, otimizando o desenvolvimento <em>front-end.</em></p> "
    },
    {
      "page": "html",
      "title": "TAGS HTML5",
      "img": "https://cdn.discordapp.com/attachments/878488898974658602/912346166358847508/Art_2_Tags_HTML5.jpg",
      "subtitle": "Lista com as principais tags HTML 5",
      "article": "h3>1. HTML</h3>\n    <p>Tag HTML é aquela que informa aos navegadores que o documento tem um código HTML:</p>\n<br>\n    <ul>\n        <li>&lt;html&gt;  &lt;/html&gt;</li>\n    </ul>\n<br>\n    <h3>2.Titulo</h3>\n    <p>Title é o título da página da web, que identifica o seu site na internet:</p>\n<br>\n    <ul>\n        <li>&lt;title&gt;  &lt;/title&gt;</li>\n    </ul>\n<br>\n    <h3>3. Cabeçalho</h3>\n    <p>Tag head é o cabeçalho do documento HTML, onde estão as informações sobre a identificação e funcionamento do site.</p>\n    <p>Também é ele que carrega os metadados, incluindo título interno de páginas e codificação do documento.</p>\n<br>\n    <ul>\n        <li>&lt;head&gt;  &lt;/head&gt;</li>\n    </ul>\n<br>\n    <h3>4.Corpo</h3>\n    <p>Representado pela abertura &lt;body&gt; e fechamento &lt;/body&gt; é no corpo dos códigos HTML que se concentram imagens, textos, vídeos e outras funcionalidades do conteúdo.</p>\n<br>\n    <ul>\n        <li>&lt;body&gt;  &lt;/body&gt;</li>\n    </ul>\n<br>\n\n    <h3>5.Imagens</h3>\n    <p>Representadas pela tag &lt;img&gt; as imagens podem ser inseridas in-line com os seguintes atributos comuns:</p>\n<br>\n    <ul>\n        <li><strong>align</strong>: é o alinhamento da imagem, que pode ser ainda top (topo), middle (meio), bottom (alinha a imagem com a base dos outros elementos da linha), left (à esquerda) ou right (à direita). </li><br>\n      \n        <li><strong>alt</strong>: é o atributo que exibe um texto alternativo em navegadores que não suportam imagens ou que são acessados por deficientes visuais.\n        </li><br>\n       \n        <li><strong>border</strong>: se refere à largura da borda da imagem.\n        </li><br>\n     \n        <li><strong>height</strong>: altura sugerida em pixels.\n        </li><br>\n\n        <li><strong>hspace</strong>:  indica o espaço entre imagem e texto que aparece à esquerda e à direita.\n        </li><br>\n\n        <li><strong>src</strong>: sinaliza a URL da imagem.\n        </li><br>\n\n        <li><strong>title</strong>: indica o texto que vai aparecer quando se passar o mouse sobre a imagem.\n        </li><br>\n\n        <li><strong>usemap</strong>:  mostra o mapeamento usado.\n        </li><br>\n\n        <li><strong>vspace</strong>: espaço entre imagem e texto que vem acima e abaixo.\n        </li><br>\n\n        <li><strong>width</strong>: extensão da imagem, em pixels.\n        </li><br>\n\n    </ul>\n    <p>Exemplo: &lt;img src=“exemplo-de-imagem.png” alt=“Texto alternativo” title=“Exemplo” /></p>\n<br>\n    <h3>6. Hiperlinks</h3>\n    <p>Hiperlinks são os atributos que servem para criar links e, assim, levar o usuário para outros sites ou páginas.</p>\n    <ul>\n        <li>&lt;a&gt;  &lt;/a&gt;</li>\n    </ul>\n<br>\n    <p>Exemplo: &lt;a href=“https://www.teste.com\">Teste.com&lt;/a&gt;</p>\n<br>\n    <h3>7. Listas</h3>\n    <p>HTML tem três tipos de listas use os atributos type e start para fazer a sua lista, dependendo dos seus interesses.</p>\n    <p><strong>Seguem os tipos de listas e suas definições:</strong></p>\n<br>\n    <ul>\n        <li><strong>&lt;ol&gt; </strong>: mostra as lista ordenada com números. </li><br>\n        <li><strong>&lt;ul&gt; </strong>: mostra as lista desordenada com pontos. </li><br>\n        <li><strong>&lt;dl&gt; </strong>: mostra as lista definições.</li><br>\n    </ul>"
    },
    {
      "page": "html",
      "title": "TAGS SEMÂNTICAS HTML5",
      "img": "https://cdn.discordapp.com/attachments/878488898974658602/912352002388934676/Art_3_Tags_Semanticas_HTML5jpg.jpg",
      "subtitle": "Conhecendo os elementos semânticos do HTML5",
      "article": "<p>O HTML é como o esqueleto que dará forma às páginas. É a estrutura mais básica. Ele setoriza as diversas partes da página de acordo com o seu conteúdo, ou seja, ajuda a endereçar cada um dos elementos que a constitui, como os textos, imagens, menu de navegação, links, dentre outros. Posteriormente ele irá auxiliar a aplicação de outras funcionalidades a um site.</p>\n    <p> Na versão o HTML5 também é responsável por descrever o significado do conteúdo presente nas páginas, visando facilitar  mecanismos de busca do Google e outros sites de pesquisa identifiquem o conteúdo da página o que façam mais sentido para os mecanismos de pesquisa (Search Engine Optimization - SEO).</p>\n\n    <br>\n\n    <p>Vamos explicar algumas dessas tags semanticas:</p>\n<br>\n    <h2><stromg>&lt; nav &gt;</stromg></h2>\n    <p>A tag &lt; nav &gt; é um dos elementos HTML5 . É usado para especificar um bloco de links de navegação, no documento atual ou para outros documentos. Exemplos de blocos de navegação são menus e índices. </p>\n    <p>Exemplo de código:</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912349586616635412/art3_nav.PNG\" alt=\"codigo nav\">\n\n    <h2><stromg>&lt; header &gt;</stromg></h2>\n    <p>A tag &lt; header &gt; é normalmente usada para definir o cabeçalho da página, essa  tag tambem pode definir um cabeçalho dentro de uma &lt; section &gt;. Normalmente essa tag possui tags de titulos com h1, h2,h3, h4, h5 ou h6.</p>\n    <p>É comum utilizá-lo para incluir a logo da empresa ou entidade, título da página, slogan ou uma descrição sobre a página/negócio.</p>\n    <p>Exemplo de código:</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912349814581243974/art3_header.PNG\" alt=\"codigo header\">\n\n    <h2><stromg>&lt; main &gt;</stromg></h2>\n    <p>A tag &lt; main &gt;  define o conteudo principal do site, aquele conteúdo de maior importâcia que voce pretende passar ao seu usuário</p>\n    <p>Só deve haver uma tag main por página, evitando o repetimento de barras laterais , links de navegação , logotipos e etc dentro dessa tag.</p>\n    <p>Exemplo de código:</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912350405994889226/art3_main.PNG\" alt=\"codigo header\">\n\n    <h2><stromg>&lt; section &gt;</stromg></h2>\n    <p>A tag &lt; section &gt;  é utilizada para marcar as seções de conteúdo de uma página. Com Esse elemento agrupamos de forma lógica nosso conteúdo, separando a informação em áreas diferentes. O principal objetivo é retirar essa responsabilidade das divs. Tendo como principal diferencial a navegação semântica com HTML 5.</p>\n    <p>Só deve haver uma tag main por página, evitando o repetimento de barras laterais , links de navegação , logotipos e etc dentro dessa tag.</p>\n    <p>Por exemplo, um menu de navegação deve estar dentro um elemento  &lt; nav &gt, mas uma lista de resultados de pesquisa ou a exibição de um mapa e seus controles não possuem elementos específicos, e podem ser colocados dentro de uma &lt; section &gt.</p>\n    <p>Exemplo de código:</p>\n\n\n\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912350758228336640/art3_section.PNG\" alt=\"codigo header\">\n\n    <h2><stromg>&lt; article &gt;</stromg></h2>\n    <p>A tag &lt; article &gt; identifica uma parte independente de conteúdo que poderia, teoricamente, ser distribuída para outros sites e plataformas como uma unidade independente. É uma boa opção para conter postagens inteiras de blog, artigos de notícias e conteúdo semelhante.</p>\n    <p>Exemplo de código:</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912348951993278534/art3_article.PNG\" alt=\"codigo header\">\n\n    <h2><stromg>&lt; figure &gt;</stromg></h2>\n    <p>A tag &lt; figure &gt; é utilizada para envolver a inserção de figuras/imagens e seus atributos. Trás a possibilidade de atribuição de descrição da figura através da tag &lt; figcaption &gt;, envolvendo tudo isto em um elemento específico.</p>\n    <p>Exemplo de código:</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912351026055635004/art3_figure.PNG\" alt=\"codigo header\">\n\n    <h2><stromg>&lt; aside &gt;</stromg></h2>\n    <p>A tag &lt; aside &gt;  é utilizada quando buscamos enfatizar um trecho de um conteúdo/artigo na página. Ou até mesmo para dispor um conteúdo à parte do restante da página, como uma sidebar.</p>\n    <p>É utilizado principalmente quando queremos chamar atenção para uma informação adicional ou enfatizar um trecho de texto que, sendo semanticamente ‘codada’ dentro de &lt; aside &gt será posicionado separadamente do conteúdo principal.</p>\n    <p>Exemplo de código:</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912349187394371644/art3_aside.PNG\" alt=\"codigo header\">\n\n    <h2><stromg>&lt; footer &gt;</stromg></h2>\n    <p>A tag &lt; footer &gt;  define um rodapé para um documento ou seção.</p>\n    <p>Dentro dessa tag colocamos as seguintes informações:</p>\n<br>\n    <ul>\n        <li>Informação de autoria</li>\n        <li>Informações sobre direitos autorais</li>\n        <li>Informações de Contato</li>\n        <li>Mapa do site</li>\n        <li>Voltar aos links principais</li>\n        <li>Documentos relacionados</li>\n        \n\n\n\n    </ul>\n    <p>Exemplo de código:</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912349187394371644/art3_aside.PNG\" alt=\"codigo header\">"
    },
    {
      "page": "html",
      "title": "EDITORES HTML",
      "img": "https://cdn.discordapp.com/attachments/878488898974658602/912354259918553088/Art_4_Editores_HTML.jpg",
      "subtitle": "Conhecendo alguns dos principais editores HTML",
      "article": "<p>Um editor de HTML é um software para edição e criação de código HTML que é usado para sites ou outros documentos da web. Com editores de HTML baseados em texto, o código-fonte pode ser editado diretamente. Os editores WYSIWYG exibem o documento a ser editado da mesma forma que será exibido no navegador posteriormente. Os editores de HTML geralmente fazem parte de um ambiente de desenvolvimento integrado .</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912352777391460422/art4_principal.PNG\" alt=\"principal\">\n<br>\n    <h2>Vamos citar alguns dos principais editores HTML:</h2>\n<br>\n\n\n    <h2>1.Atom </h2>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912352897545666620/art4_atom.PNG\" alt=\"atom\">\n    <p>O Atom é um editor de texto gratuito desenvolvido pelo GitHub e sua comunidade. Algumas de suas características são: compartilhamento de código em tempo real; conexão direta com repositório Git e GitHub; gerenciamento de pacotes de funcionalidades; sistema de preenchimento de código automático; instalação em Windows, OS X e Linux; Ideal para HTML e outras linguagens Web.</p>\n<br>\n    <h2>2. Sublime Text </h2>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912353111614562314/art4_Sublime.PNG\" alt=\"Sublime\">\n    <p>O Sublime Text é um editor de texto para código e marcação de dados. Ele é pago, mas pode ser testado gratuitamente. Suas características são: atalhos de teclado inteligentes; múltiplas seleções e alterações simultâneas; API e pacotes; edição divida de scripts; interruptor instantâneo de projeto; licença cruzada de plataformas; editor HTML completo e outras linguagens Web.</p>\n<br>\n    <h2>3. Visual Studio Code </h2>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912353239549231184/art4_VS_CODE.PNG\" alt=\"VS_CODE\">\n    <p>O Visual Studio Code é um editor de texto gratuito desenvolvido pela Microsoft. Algumas de suas características são: recurso IntelliSense para preenchimento automático de variáveis e funções; depuração; Git incorporado; extensível e personalizável; instalação em Windows, Linux e Mac.</p>\n<br>\n    <h2>4. Notepad++</h2>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912353415231836200/art4_VS_notepad.PNG\" alt=\"notepad++\">\n    <p>O Notepad++ é um editor de texto gratuito e simples, muito popular na Web, ideal para edições rápidas. Ele possui diversos recursos e alguns deles são: realce de sintaxe; mapeamento do documento; preenchimento automático; compatibilidade com diversas linguagens; gravação de macros; editor HTML completo; abertura de múltiplos documentos e vistas.</p>\n\n\n<br>\n    <h2>5. Eclipse </h2>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912353548551991306/art4_VS_eclipse.PNG\" alt=\"eclipse\">\n    <p>O Eclipse é um IDE completo, bem popular para programadores JAVA, mas é compatível com diversas linguagens e é totalmente extensível. Ele é um dos mais conceituados ambientes de programação e conta também com um editor de texto completo. Existem versões alternativas de distribuições para desenvolvimento web com HTML, PHP e Android.</p>"
    },
    {
      "page": "html",
      "title": "FORMULÁRIOS E ENTRADAS (INPUTS) EM HTML",
      "img": "https://cdn.discordapp.com/attachments/878488898974658602/912357867313569802/Art_5_Formularios_e_Entradas_inputsHTML.jpg",
      "subtitle": "Conhecendo formulários html",
      "article": "<p>Formulários HTML são um dos principais pontos de interação entre um usuário e um web site ou aplicativo. Eles permitem que os usuários enviem dados para o web site. Na maior parte do tempo, os dados são enviados para o servidor da web, mas a página da web também pode interceptar para usá-los por conta própria.</p>\n<br>\n    <h2>Formulários</h2>\n    <p>Os elementos de formulário são elementos que permitem o usuário entrar informação (como campos de texto, campos de área de texto, menus drop-down, botões radiais, caixas de seleção, etc.) em um formulário.</p>\n    <p>Um formulário é definido pela tag &lt; form &gt;,</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912356303869980702/art5_form.png\" alt=\"form\">\n    <p>Com essa saida:</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912356304192958514/art5_form_saida.png\" alt=\"form_saida\">\n<br>\n    <h2>Entrada (Input)</h2>\n    <p>É usado para criar controles interativos para formulários baseados na web para receber dados do usuário. A semântica de um &lt; input &gt; varia consideravelmente dependendo do valor de seu atributo type.   </p>\n<br>\n    <h3>Campo de Texto</h3>\n    <p>Os campos de texto são usados quando você quer que o usuário digite letras, números, etc. em um formulário.</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912356304473964614/art5_input_text.png\" alt=\"form\">\n    <p>Com essa saida:</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912356304763363378/art5_input_text_saida.png\" alt=\"form\">\n    <br>\n    <h2>Botões Radiais</h2>\n    <p>Os botões de rádio são usados para permitir aos usuários escolher uma opção de uma lista de opções. Para ser possível fazer esse tipo de formulário, primeiro iremos precisar de dar nome aos campos.</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912356305094737930/art5_radio.png\" alt=\"form\">\n    <p>Com essa saida:</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912356305296056350/art5_radio_saida.png\" alt=\"form\">\n<br>\n    <h2>Checkbox</h2>\n    <p>O HTML checkbox, que também é chamado de caixa de checagem, é um dos tipos disponíveis no elemento &lt; input &gt;, que significa entrada, e é utilizado quando queremos permitir que a pessoa usuária da aplicação selecione uma ou mais alternativas entre as opções disponíveis.</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912356306017472512/art5_checkbox.png\" alt=\"checkbox\">\n    <p>Com essa saida:</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912357369357406248/art5_checkbox_saida.png\" alt=\"checkbox\">\n    <br>\n    <h2>O Atributo Ação do Formulário (Form's Action) e o Botão Enviar (Submit)</h2>\n    <p>Quando o usuário clica no botão \"Enviar\", o conteúdo do formulário é enviado para outro arquivo. O atributo de ação do formulário define o nome do arquivo para o qual enviar o conteúdo. O arquivo definido no atributo action geralmente faz algo com a entrada recebida.</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912356305518334012/art5_submit.png\" alt=\"checkbox\">\n    <p>Com essa saida:</p>\n    <img src=\"https://cdn.discordapp.com/attachments/878488898974658602/912356305790976000/art5_submit_saida.png\" alt=\"checkbox\">"
    }
  ],
  "css": [
    {
      "page": "css",
      "title": "O QUE É CSS",
      "img": "https://www.chiefofdesign.com.br/wp-content/uploads/2018/08/thumbs-YT-HTML.png",
      "subtitle": "Para que server e sua importância",
      "article": "  <p><strong>CSS</strong>: O design de um site é fundamental para quem acessa seu conteúdo. Portanto, deve ter uma boa aparência e ter uma usabilidade muito amigável, tornando mais fácil para os visitantes encontrarem as informações que procuram, caso contrário, eles desaparecerão em menos tempo do que leva para encontrá-las. Portanto, CSS fornece suporte nativo para tornar a formatação de páginas da web muito simples.</p>\n\n  <p><strong>CSS</strong> é chamado de linguagem <strong>Cascading Style Sheet</strong>, e é usado para definir o estilo de elementosescritos em uma linguagem de marcação, como HTML. CSS separa o conteúdo da apresentação visual do site. Use CSS para alterar o texto e a cor do fundo, a fonte e o espaçamento entre os parágrafos. Você também pode criar tabelas, usar alterações de layout, ajustar as imagens de suas respectivas telas e muito mais. </p>\n\n  <img src=\"https://cdn.discordapp.com/attachments/903657891091861564/913533536802320434/56dd4dc9c44936865315a59190c41cf1.png\"/>\n\n\n  <h2>Importância do css</h2>\n\n  <p>Além de melhorar o visual do site, o CSS também é responsável por:</p>\n  <ul><li>Deixar o site responsivo (Site se adequar melhor a vários tipos de tela e resoluções)</li><li>Controlar os layouts de vários documentos a partir de um único, deixar os códigos mais limpos e organizados, fazer transições e animações que fazem uma experiencia melhor ao usurário.</li></ul>"
    },
    {
      "page": "css",
      "title": "COMO INTEGRAR O CSS NO HTML?",
      "img": "https://i1.wp.com/www.tecforest.com.br/wp-content/uploads/2019/04/Como-Linkar-Folhas-de-Estilo-CSS-no-HTML-1.png?resize=700%2C362&ssl=1",
      "subtitle": "",
      "article": "<h2>CSS Externo:</h2>\n<p>Crie um arquivo com .css no final, para ser reconhecido como um arquivo de CSS.\nPara integrar o CSS no HTML é necessário que use um arquivo de CSS e avise o HTML que existe um arquivo de estilo, consulte o exemplo: <link rel=\"stylesheet\" type=\"text/css\" href=\"style.css\"> Esta tag indicará ao HTML que ele possui um arquivo CSS para adicionar à página. Isso deve ser adicionado à tag <head> </head> do HTML.</p>\n<br/>\n  <p>Veja um exemplo de CSS externo:</p>\n\n<img src=\"https://cdn.discordapp.com/attachments/638595322075021322/913514137051598898/unknown.png\"/>\n \n\n<br/>\n<p>Inline (em linha) – Aplique as regras CSS para elementos específicos.  </p>\n\n  <img src=\"https://cdn.discordapp.com/attachments/638595322075021322/913514168018169886/unknown.png\"/>\n \n<br/>\n  <p>Declarar na mesma página - Adicionar a tag \"style\" na seção do documento HTML. </p>\n<img src=\"https://cdn.discordapp.com/attachments/638595322075021322/913514184690515998/unknown.png\"/>\n\n<h1>Como CSS Funciona</h1>\n<p>O CSS é uma ferramenta muito boa que possibilita criar diversas funcionalidades ao invés de usar JavaScript ou outra linguagem mais pesada.</p>\n<br/>\n<p>Com o Cascading Style Sheets (CSS) é possível criar animações complexas, criar efeitos com uso de parallax, que faz parecer que a imagem de fundo tem uma profundidade diferente um dos outros, criar sites interativos e também jogos com HTML5 e CSS3.\n</p>"
    },
    {
      "page": "css",
      "title": "COMO CSS FUNCIONA",
      "img": "https://i.workana.com/wp-content/uploads/2018/11/css-1.jpg",
      "subtitle": "",
      "article": "<p>O CSS é uma ferramenta muito boa que possibilita criar diversas funcionalidades ao invés de usar JavaScript ou outra linguagem mais pesada.</p>\n</br>\n<p>Com o Cascading Style Sheets (CSS) é possível criar animações complexas, criar efeitos com uso de parallax, que faz parecer que a imagem de fundo tem uma profundidade diferente um dos outros, criar sites interativos e também jogos com HTML5 e CSS3.</p>\n<h1>SINTAXE CSS</h1>\n\nA estrutura da sintaxe CSS é bem simples. É formada por uma regra de 3 itens fundamentais para definir um estilo. São eles:\n\n<ul>\n  <li>Seletor</li>\n\n  <li>Propriedade</li>\n\n  <li>Valor</li>\n  </ul>\n\n<h2>Veja o exemplo a seguir:</h2>\n\n<img src=\"https://cdn.discordapp.com/attachments/903657891091861564/913518820004601876/unknown.png\"/>\n \n<ul>\n  <li><strong>Seletor</strong> -\nEle seleciona o elemento a ser estilizado (neste caso, o elemento \"p\"). Para estilizar outro elemento, basta alterar o seletor.</li>\n\n  <li><strong>Declaração</strong> - Uma regra simples, como color: red; especifique os atributos do elemento a serem estilizados.</li>\n  <li><strong>Propriedades</strong>\nForma de como você estilizar elementos HTML. (Nesse caso, o color é um atributo do elemento \"p\".) Em CSS, você pode escolher quais atributos deseja que afetem a regra.</li>\n\n  <li><strong>Valor da propriedade </strong>\nNo lado direito do atributo, após os dois pontos, temos o valor do atributo, que seleciona uma das muitas aparências possíveis para um determinado. Além do red (vermelho), há muitos valores de color (cores)</li>\n</ul>\n<p>O seletor \"p\" que usamos no exemplo anterior é um seletor de tipo de elemento. Esse tipo de seletor identifica e vincula um elemento HTML e só precisa usar esse elemento como um seletor.</p>\n    \n\n  <p>Seletor de tipo id deve ser criado com o nome e posteriormente pelo símbolo #.</p>\n<img src=\"https://cdn.discordapp.com/attachments/878387189539569664/913519983882022942/unknown.png\"/>\n\n \n  <p>Seletor de tipo class deve ser criado com o nome e posteriormente por um ponto “.”</p>\n<img src=\"https://cdn.discordapp.com/attachments/878387189539569664/913520310383423538/unknown.png\"/>\n \n    <ul>\n      <li>Cada linha de comando deve ser envolvida em chaves ({}).</li>\n<li>Dentro de cada declaração, você deve usar dois pontos (:) para separar a propriedade de seus valores.</li>\n<li>Dentro de cada conjunto de regras, você deve usar um ponto e vírgula (;) para separar cada declaração da próxima.</li>\n</ul>\n<p>Então para modificar múltiplos valores de propriedades de uma vez, você deve escrevê-los separados por ponto e vírgula, desse modo: </p>\n\n\n<img src=\"https://cdn.discordapp.com/attachments/878387189539569664/913521171629211728/unknown.png\"/>"
    },
    {
      "page": "css",
      "title": "COMO CSS FUNCIONA",
      "img": "https://cdn-thumbs.comidoc.net/750/1341268_c20e_3.jpg",
      "subtitle": "",
      "article": "<p>O CSS é uma ferramenta muito boa que possibilita criar diversas funcionalidades ao invés de usar JavaScript ou outra linguagem mais pesada.</p>\n</br>\n<p>Com o Cascading Style Sheets (CSS) é possível criar animações complexas, criar efeitos com uso de parallax, que faz parecer que a imagem de fundo tem uma profundidade diferente um dos outros, criar sites interativos e também jogos com HTML5 e CSS3.</p>\n<h1>SINTAXE CSS</h1>\n\nA estrutura da sintaxe CSS é bem simples. É formada por uma regra de 3 itens fundamentais para definir um estilo. São eles:\n\n<ul>\n  <li>Seletor</li>\n\n  <li>Propriedade</li>\n\n  <li>Valor</li>\n  </ul>\n\n<h2>Veja o exemplo a seguir:</h2>\n\n<img src=\"https://cdn.discordapp.com/attachments/903657891091861564/913518820004601876/unknown.png\"/>\n \n<ul>\n  <li><strong>Seletor</strong> -\nEle seleciona o elemento a ser estilizado (neste caso, o elemento \"p\"). Para estilizar outro elemento, basta alterar o seletor.</li>\n\n  <li><strong>Declaração</strong> - Uma regra simples, como color: red; especifique os atributos do elemento a serem estilizados.</li>\n  <li><strong>Propriedades</strong>\nForma de como você estilizar elementos HTML. (Nesse caso, o color é um atributo do elemento \"p\".) Em CSS, você pode escolher quais atributos deseja que afetem a regra.</li>\n\n  <li><strong>Valor da propriedade </strong>\nNo lado direito do atributo, após os dois pontos, temos o valor do atributo, que seleciona uma das muitas aparências possíveis para um determinado. Além do red (vermelho), há muitos valores de color (cores)</li>\n</ul>\n<p>O seletor \"p\" que usamos no exemplo anterior é um seletor de tipo de elemento. Esse tipo de seletor identifica e vincula um elemento HTML e só precisa usar esse elemento como um seletor.</p>\n    \n\n  <p>Seletor de tipo id deve ser criado com o nome e posteriormente pelo símbolo #.</p>\n<img src=\"https://cdn.discordapp.com/attachments/878387189539569664/913519983882022942/unknown.png\"/>\n\n \n  <p>Seletor de tipo class deve ser criado com o nome e posteriormente por um ponto “.”</p>\n<img src=\"https://cdn.discordapp.com/attachments/878387189539569664/913520310383423538/unknown.png\"/>\n \n    <ul>\n      <li>Cada linha de comando deve ser envolvida em chaves ({}).</li>\n<li>Dentro de cada declaração, você deve usar dois pontos (:) para separar a propriedade de seus valores.</li>\n<li>Dentro de cada conjunto de regras, você deve usar um ponto e vírgula (;) para separar cada declaração da próxima.</li>\n</ul>\n<p>Então para modificar múltiplos valores de propriedades de uma vez, você deve escrevê-los separados por ponto e vírgula, desse modo: </p>\n\n\n<img src=\"https://cdn.discordapp.com/attachments/878387189539569664/913521171629211728/unknown.png\"/>"
    },
    {
      "page": "css",
      "title": "UNIDADES DE MEDIDAS NO CSS",
      "img": "https://www.codingninjas.com/blog/wp-content/uploads/2020/08/Blog-32.png",
      "subtitle": "",
      "article": "A unidade de medida no CSS tem como objetivo definir o tamanho de uma propriedade:\n<br/>\n <br/>\nExpandir\nmessage.txt\n3 KB\n<h2>Algumas das propriedades mais utilizadas no CSS, aqui vai alguns exemplos:</h2>\n<br/>\n<br/>\n<ul>\n<li>background – Define cor de fundo, imagem ou transparência.</li>\n<li>background-image -Imagem de fundo.</li>\n<li>background-color - Cor de fundo ou transparência.</li>\n<li>border - Largura, estilo e cor de todas as 4 bordas.</li>\n<li>border-bottom - Largura, estilo e cor da borda inferior.</li>\n<li>border-left -    Largura, estilo e cor da borda esquerda.</li>\n<li>border-right - Largura, estilo e cor da borda direita.</li>\n<li>border-top - Largura, estilo e cor da borda superior.</li>\n<li>border-width - Largura de todas as 4 bordas.</li>\n<li>import    - Folha de estilo a importar.</li>\n<li>font-family -    Tipo de fonte.</li>\n<li>font-size - Tamanho da fonte.</li>\n<li>height - Altura exibida ao elemento.</li>\n<li>width -    Largura do elemento.</li>\n<li>margin - Tamanho de todas as 4 margens.</li>\n<li>margin-left -    Tamanho da margem esquerda.</li>\n<li>margin-right - Tamanho da margem direita.</li>\n<li>margin-bottom - Tamanho da margem inferior.</li>\n<li>margin-top -    Tamanho da margem superior.</li>\n<li>padding - Espaço em torno de um elemento em todos os lados.</li>\n<li>padding-bottom - Espaço a partir da margem inferior de um elemento.</li>\n<li>padding-left - Espaço à esquerda do elemento.</li>\n<li>padding-right - Espaço à direita do elemento.</li>\n<li>padding-top - Espaço a partir da margem superior do elemento.</li>\n<li>text-align - Alinhamento do texto.</li>\n</ul>\n<br/>\n<p>Confira mais alguns exemplos de propriedades nestes sites\n</p>\n<p><a href=\"https://madsonlimasouza.wordpress.com/2012/01/09/lista-de-tags-e-atributos-css/\">Primeiro site</a></p>\n  <p><a href=\"https://tympanus.net/codrops/css_reference/\">Segundo site</a></p>"
    }
  ],
  "js": []
}